rushairer/LearnCW32/Libraries/src/cw32f030_adc.c
/**
 * @brief
 *        设置单通道ADC转换结果溢出保存策略
 *
 * @param enDiscard:
 *        @arg ADC_DiscardNull
 *        @arg ADC_DiscardEnable
 */
void ADC_SetDiscard(uint32_t enDiscard)
{
    assert_param(IS_ADC_DATA_DISCARD(enDiscard));
    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DISCARD_Msk, enDiscard);
}

/**
 * @brief
 *        设置内置温度传感器使能控制
 *
 * @param enTs:
 *        @arg ADC_TsDisable
 *        @arg ADC_TsEnable
 */
void ADC_SetTs(uint32_t enTs)
{
    assert_param(IS_ADC_TS_ENABLE(enTs));
    REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_TSEN_Msk, enTs);
}

/**
 * @brief
 *        读取ADC参考电压1.5V时的温度传感器的测量温度
 *
 * @param fAdcTsDegree
 */
void ADC_GetTsVref1V5(float *fAdcTsDegree)
{
    uint16_t u16AdcResult;
    uint8_t temp1;
    uint16_t temp2;
    temp1 = *((uint8_t *)(ADDR_T0));
    temp2 = *((uint16_t *)(ADDR_TRIM_1P5));
    /*Caution: Must select ADC_GetSqr0Result()~ADC_GetSqr3Result() instead of ADC_GetConversionValue() if using ADC_SQR convertion.
    * ADC single channel convertion is default.
    */
    u16AdcResult = ADC_GetConversionValue();
    //ADC_GetSqr0Result(&u16AdcResult);    //Using ADC_SQR0.
    //ADC_GetSqr1Result(&u16AdcResult);    //Using ADC_SQR1.
    //ADC_GetSqr2Result(&u16AdcResult);    //Using ADC_SQR2.
    //ADC_GetSqr3Result(&u16AdcResult);    //Using ADC_SQR3.
    *fAdcTsDegree = temp1 * 0.5f + COEFF_TS * 1.5f * (u16AdcResult - temp2);
}

/**
 * @brief
 *        读取ADC参考电压2.5V时的温度传感器的测量温度
 *
 * @param fAdcTsDegree
 */
void ADC_GetTsVref2V5(float *fAdcTsDegree)
{
    uint16_t u16AdcResult;
    uint8_t temp1;
    uint16_t temp2;
    temp1 = *((uint8_t *)(ADDR_T0));
    temp2 = *((uint16_t *)(ADDR_TRIM_2P5));
    /*Caution: Must select ADC_GetSqr0Result()~ADC_GetSqr3Result() instead of ADC_GetConversionValue() if using ADC_SQR convertion.
    * ADC single channel convertion is default.
    */
    u16AdcResult = ADC_GetConversionValue();
    //ADC_GetSqr0Result(&u16AdcResult);    //Using ADC_SQR0.
    //ADC_GetSqr1Result(&u16AdcResult);    //Using ADC_SQR1.
    //ADC_GetSqr2Result(&u16AdcResult);    //Using ADC_SQR2.
    //ADC_GetSqr3Result(&u16AdcResult);    //Using ADC_SQR3.
    *fAdcTsDegree = temp1 * 0.5f + COEFF_TS * 2.5f * (u16AdcResult - temp2);
}

/**
 * @brief
 *          ADC自动停止配置
 *
 * @param   enAutoStop:
 *          @arg ADC_AutoStopDisable
 *          @arg ADC_AutoStopEnable
 */
void ADC_AutoStop(uint32_t enAutoStop)
{
    REGBITS_MODIFY(CW_ADC->START, ADC_START_AUTOSTOP_Msk, enAutoStop);
}

/**
 * @brief
 *          ADC中断配置
 *
 * @param   ADC_IT:
 *          @arg ADC_IT_READY
 *          @arg ADC_IT_OVW
 *          @arg ADC_IT_WDTR
 *          @arg ADC_IT_WDTH
 *          @arg ADC_IT_WDTL
 *          @arg ADC_IT_EOA
 *          @arg ADC_IT_EOS
 *          @arg ADC_IT_EOC
 * @param   NewState:
 *          @arg DISABLE
 *          @arg ENABLE
 */
void ADC_ITConfig(uint16_t ADC_IT, FunctionalState NewState)
{
    uint8_t itMask = 0;
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_ADC_IT(ADC_IT));
    /* Get the ADC IT index */
    itMask = (uint8_t) ADC_IT;
    if (NewState != DISABLE)
    {
        /* Enable the selected ADC interrupts */
        CW_ADC->IER |= itMask;
    }
    else
    {
        /* Disable the selected ADC interrupts */
        CW_ADC->IER &= (~(uint32_t) itMask);
    }
}

/**
 * @brief
 *          使能NVIC中ADC中断
 *
 * @param   intPriority:
 *          @arg 0 ~ 3
 */
void ADC_EnableNvic(uint8_t intPriority)
{
    if (intPriority < (1UL << __NVIC_PRIO_BITS))
    {
        NVIC_ClearPendingIRQ(ADC_IRQn);
        NVIC_EnableIRQ(ADC_IRQn);
        NVIC_SetPriority(ADC_IRQn, intPriority);
    }
}

/**
 * @brief
 *          禁用NVIC中ADC中断
 *
 * @param
 *
 */
void ADC_DisableNvic(void)
{
    NVIC_ClearPendingIRQ(ADC_IRQn);
    NVIC_DisableIRQ(ADC_IRQn);
    NVIC_SetPriority(ADC_IRQn, ADC_INT_PRIORITY);
}
//@} // AdcGroup

/******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/

